#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fer1035/aws02/runs/run-m3asYKCgC255dRC6

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.ansible.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:531133914787:cluster/ansible]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ansible.aws_ecs_cluster.cluster has changed
  ~ resource "aws_ecs_cluster" "cluster" {
        id                 = "arn:aws:ecs:us-east-1:531133914787:cluster/ansible"
        name               = "ansible"
      + tags               = {}
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ansible.aws_ecr_lifecycle_policy.lifecycle will be created
  + resource "aws_ecr_lifecycle_policy" "lifecycle" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire untagged images after 1 day"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "ansibledocker"
    }

  # module.ansible.aws_ecr_repository.repository will be created
  + resource "aws_ecr_repository" "repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ansibledocker"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.ansible.aws_ecr_repository_policy.policy will be created
  + resource "aws_ecr_repository_policy" "policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:DescribeRepositories",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:ListImages",
                          + "ecr:DeleteRepository",
                          + "ecr:BatchDeleteImage",
                          + "ecr:SetRepositoryPolicy",
                          + "ecr:DeleteRepositoryPolicy",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "ansibledocker"
    }

  # module.ansible.aws_ecs_cluster.cluster must be replaced
-/+ resource "aws_ecs_cluster" "cluster" {
      ~ arn                = "arn:aws:ecs:us-east-1:531133914787:cluster/ansible" -> (known after apply)
      ~ capacity_providers = [] -> (known after apply)
      ~ id                 = "arn:aws:ecs:us-east-1:531133914787:cluster/ansible" -> (known after apply)
      ~ name               = "ansible" -> "ansibledocker" # forces replacement
      - tags               = {} -> null
      ~ tags_all           = {} -> (known after apply)

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      - setting {
          - name  = "containerInsights" -> null
          - value = "disabled" -> null
        }
      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # module.ansible.aws_ecs_task_definition.task will be created
  + resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "ansibledocker"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.ansible.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTaskExecution"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ]
      + max_session_duration  = 3600
      + name                  = "ansibledocker_ECSTaskRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 1 to destroy.


```

</details>

*Pusher: @fer1035, Action: `pull_request`*